# PANDAS

 ### Pandas is a Python library.
 ### Pandas is used to analyze data.

### What is Pandas?
 * Pandas is a Python library used for working with data sets.
It has functions for analyzing, cleaning, exploring, and manipulating data.
The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

### Why Use Pandas?
 * Pandas allows us to analyze big data and make conclusions based on statistical theories.
Pandas can clean messy data sets, and make them readable and relevant.
Relevant data is very important in data science.

### KEY VALUES

In [3]:
import pandas as pd
ap = {"day1": 943, "day2": 490, "day3": 890}
ap11 = pd.Series(ap)
print(ap11)

day1    943
day2    490
day3    890
dtype: int64

In [7]:
import pandas as pd 
import numpy as np 

tpp = np.array(['a', 'b', 'c', 'd', 'e','x','y','sham']) 

# creating series 
xyz = pd.Series(tpp) 
print(xyz)

0       a
1       b
2       c
3       d
4       e
5       x
6       y
7    sham
dtype: object

In [8]:
import pandas as pd
data = {
    "Number":[12,24,23] ,
    "Name":['gana', 'sandip', 'pushpa']
}
ap = pd.DataFrame(data)
print(ap)

   Number    Name
0      12    gana
1      24  sandip
2      23  pushpa

In [9]:
import pandas as pd
data = {
    "Number":[12,24,23] ,
    "Name":['gana', 'sandip', 'pushpa']
}
ap = pd.DataFrame(data)
print(ap.iloc[1:2])

   Number    Name
1      24  sandip

###  Data Cleaning: .isnull(), .dropna(), .fillna()

In [11]:
import pandas as pd
import numpy as np

info = {
    "1st":[100,66,12,np.nan],
    "2ed":[89,np.nan,87,96],
    "3rd":[12,np.nan,29,87]
}
xy = pd.DataFrame(info)
missing_value=xy.isnull()
print(missing_value)

     1st    2ed    3rd
0  False  False  False
1  False   True   True
2  False  False  False
3   True  False  False

### .dropna()

In [12]:
import pandas as pd
import numpy as np

info = {
    "1st":[100,66,12,np.nan],
    "2ed":[89,np.nan,87,96],
    "3rd":[12,np.nan,29,87]
}
xy = pd.DataFrame(info)
xy.dropna()

     1st   2ed   3rd
0  100.0  89.0  12.0
2   12.0  87.0  29.0

### .filna()

In [14]:
import pandas as pd
import numpy as np

info = {
    "1st":[100,66,12,np.nan],
    "2ed":[89,np.nan,87,96],
    "3rd":[12,np.nan,29,87]
}
xy = pd.DataFrame(info)
xy.fillna(1)

     1st   2ed   3rd
0  100.0  89.0  12.0
1   66.0   1.0   1.0
2   12.0  87.0  29.0
3    1.0  96.0  87.0

###  Renaming: df.rename()

In [16]:
import pandas as pd

ap = pd.DataFrame({'X': [1, 2, 3], 'Y': [4, 5, 6], 'Z': [7, 8, 9]})# Sample DataFrame
print(ap)

ap.rename(columns={'X': 'x', 'Y': 'y', 'Z': 'z'}, inplace=True)# Renaming columns
print(ap)

   X  Y  Z
0  1  4  7
1  2  5  8
2  3  6  9
   x  y  z
0  1  4  7
1  2  5  8
2  3  6  9

### .isnull()

In [20]:
import pandas as pd

ap = pd.DataFrame({
    "1st":[100,66,12,18],
    "2ed":[89,33,87,96],
    "3rd":[12,78,29,87]
})
                  
ap_filter=ap[ap['2ed']>24]
print(ap_filter)
ap.isnull().sum()

   1st  2ed  3rd
0  100   89   12
1   66   33   78
2   12   87   29
3   18   96   87

1st    0
2ed    0
3rd    0
dtype: int64

* Aggregation and Grouping:
* GroupBy: df.groupby('col')
* Aggregation: .sum(), .mean(), .count()

In [21]:
import pandas as pd
import numpy as np

ap = pd.DataFrame({
    'Name': ['ram','sham','pushapa','ganesh'],
    'Age': [11,12,13,14],
    'Country': ['india','ap','u','k']
})

set = ap.groupby("Country")
print(set.first())

            Name  Age
Country
ap          sham   12
india        ram   11
k         ganesh   14
u        pushapa   13

### .sum()

In [22]:
import pandas as pd

ap = pd.DataFrame({
    'Name': ['ram','sham','pushapa','ganesh'],
    'Age': [11,12,13,14],
    'Country': ['india','ap','u','k']
})

ap.sum()

Name       ramshampushapaganesh
Age                          50
Country               indiaapuk
dtype: object

In [26]:
import pandas as pd

ap = pd.DataFrame({'Age': [28,54,76, 24, 35, 32,56]})
ap11=df.count()
print(ap11)

Age    5
dtype: int64

## Merging and Joining: pd.merge(), df.conacat()

In [28]:
import pandas as pd

info1 = {
  "name": ["Sonu", "Ram", "Harsh"],
  "age": [35, 44, 23]
}

info2 = {
  "name": ["Sonu", "Ram", "Harsh"],
  "city": ["Pune","gova","Kolkata"]
}

abc = pd.DataFrame(info1)
xyz = pd.DataFrame(info2)
ap=pd.merge(abc,xyz, on="name")
print(ap)

    name  age     city
0   Sonu   35     Pune
1    Ram   44     gova
2  Harsh   23  Kolkata

In [29]:
import pandas as pd

info1 = {
  "name": ["Sonu", "Ram", "Harsh"],
  "age": [35, 44, 23]
}

info2 = {
  "name": ["Sonu", "Ram", "Harsh"],
  "city": ["Pune","gova","Kolkata"]
}

abc = pd.DataFrame(info1)
xyz = pd.DataFrame(info2)
pd.concat([abc, xyz])

    name   age     city
0   Sonu  35.0      NaN
1    Ram  44.0      NaN
2  Harsh  23.0      NaN
0   Sonu   NaN     Pune
1    Ram   NaN     gova
2  Harsh   NaN  Kolkata